TOKEN = '6013919640:AAHd1ShmwsLvcM1x8HYiQaDNGJxZcehsOhQ'  #токен бота
ADMINS = [1006534370, 1002930622, 1196315173, 118198979]
MEGACHAT = -1001612535843
log_chat = -1001847368960
TESTCHAT = 't.me/+qL1pdUcxPNo4YTY6'
MEGACHATLINK = 't.me/'
JIVADMCHAT = 't.me/+RKDH5__QhyQyNTA6'
BAFFUADM = 't.me/'
LOGCHATLINK = 't.me/+YsKKpKg3BDkxNTFi'

# линии метро
METRO = [
            [   
                'Площадь Админов', 'Восток', 'Поречье', 'Микитская улица',
                'Александровская', 'Ботаническая', 'Парк Победы', 'Университет',
                'Котайский проспект', 'Старый город', 'Котаево', 'Зоопарк',
                'Котайский электрозавод', 'Ратуша', 'Михайлово', 'Крайний Юг', 'Никитино',
                'Даниловская', 'Агзамовщина', 'Историческая'
            ],
            [
                'Котайский Мединститут', 'Улица 8 Марта', 'Аэропорт Котай',
                'Александровская', 'Георгиевская', 'Живбанк', 'Первоапрельская',
                'Автопарк им. Кота', 'Вокзальная', 'ТЦ МиГ', 'Генерала Шелби',
                'Юго-Западная', 'Историческая', 'Кольцевая', 'Генерала Шелби'
            ],
            [
                'Крайний Север', 'Площадь Админов', 'Ракенская', 'Райбольница',
                'Живополисский музей', 'Тропическая', 'Живополис-Восточный',
                'Роща', 'Вокзальная', 'Автовокзал Живополис', 'Живополис-Южный',
                'Старый город', 'Котай-Главный', 'Мясокомбинат', 'Котай-Западный',
                'Максименка', 'Переулок Феликса', 'Улица 8 Марта', 'Северянка',
                'Крайний Север'
            ],
            [
                'Северо-Восток', 'Аэродромная', 'Полночь', 'Райбольница',
                'Котянка', 'Макеевка', 'Георгиевская', 'Ботаническая',
                'Автозаводская', 'Максименка', 'Западница', 'Мясокомбинат',
                'Университет', 'Стадион', 'Победа', 'Ботаническая'
            ]
        ]

#маршрут троллейбуса
CITY = \
    [
        'Площадь Админов', 'Восток', 'Поречье', 'Река Олёнка', 'Микитская улица',
        'АС Александрово', 'Александровская', 'Ботаническая', 'Парк Победы',
        'Университет', 'Котайский проспект', 'Старый город', 'Старово', 'Котаево',
        'Зоопарк', 'Котайский электрозавод', 'Ратуша', 'Михайлово', 'Крайний Юг',
        'Никитино', 'Даниловская', 'Агзамовщина', 'Историческая',
        'Котайский Мединститут', 'Улица 8 Марта', 'Аэропорт Котай',
        'Географический центр', 'Улица Центральная', 'Георгиевская', 'Живбанк',
        'Первоапрельская', '3-й микрорайон', 'Автопарк им. Кота', 'Вокзальная',
        'ТЦ МиГ', 'Генерала Шелби', 'Юго-Западная', 'Улица Кодовая', 'Кольцевая',
        'Крайний Север', 'Ракенская', 'Райбольница', 'Живополисский музей',
        'Тропическая', 'Живополис-Восточный', 'Роща', 'Автовокзал Живополис',
        'Улица Лесная', 'Живополис-Южный', 'Станция Котай', 'Котай-Главный',
        'Мясокомбинат', 'Котай-Западный', 'Максименка-Западница', 'Максименка',
        'Переулок Феликса', 'Улица 8 Марта', 'Северянка', 'Северо-Восток',
        'Аэродромная', 'Национальный аэропорт', 'Полночь', 'Райбольница', '7-й км',
        'Котянка', 'Макеевка', '18-й км', 'Автозаводская', 'Западница', 'Стадион',
        'Победа', 'Улица Спортивная', 'пос. Красный'
    ]

#маршрут автобуса
villages = \
    [
        'Автовокзал Живополис', 'АС Александрово', 'Красный',
        'Максименка-Западница', 'Глубинка', 'Цель', '18-й км', 'Старокотай',
        'Микитай', 'Загорье', 'Попережье', 'Деревцы'
    ]

#лотерейные призы
PRIZES = \
    [
        'morj', 0, 10, 10, 10, 100, 3, 14, 90, 5, 1000, 10, 3, 3, 3, 5, 5, 0, 10,
        5, 0, 0, 10, 5, 3, 3, 5, 5, 10, 14, 14, 14, 5, 5, 10, 5, 0, 'cow', -5, -10,
        0, 5, 10
    ]

ID = 2055111795  #айди бота

SUPPORT_LINK = 't.me/'

CREATOR = 1006534370  #создатель
MODER = [1006534370]  #модераторы

BOT_USER = 't.me/altJivopolisBot'
banned = []  #пользователи в бане

WALK = \
    [ ##список мест, в которые можно добраться пешком
        [
            'Национальный аэропорт', 'Станция Котай', 'АС Александрово',
            'Площадь Админов', 'Старокотай', 'Красный',
        ],
        [
            'Аэродромная', 'Котай-Главный', 'Александровская', 'Рынок',
            'Старокотайский ФАП', 'пос. Красный',
        ],
        [
            '', '', '', 'Админская улица', '', ''
        ],
    ] 


walks = [45, 60, 90, 45, 75, 60]  #продолжительность ходьбы #todo insert into walk
limeteds = ['bread', 'tea', 'pita', 'pelmeni', 'meat_on_bone']  #дефицитные товары #todo rename

'''
## ITEMS = \
    [
        [ ##иконки предметов
            '🦭', '📦', '🐄', '🗝', '🦊', '🔫', '🐺', '🦺', '👺', '👨', '💣', '🎊',
            '🎆', '🎉', '🤶', '🎅', '🧚', '❄', '☃️', '🦔', '🚚', '🥇', '🥈', '🥉',
            '🧪', '💊', '🥖', '🥛', '🍜', '🍲', '🍏', '🌯', '🍔', '🍕', '🥥', '🥝', 
            '🍅', '🍟', '🥒', '🍝', '🍩', '🍱', '🍺', '🍖', '🥟', '☕', '🍚', '🍪', 
            '🍰', '🍶', '🥙', '🚗', '🚙', '🤡', '👻', '👽', '🤖', '💩', '🫕', '🥤',
            '🌵', '🌴', '🪴', '🍀', '🌷', '🌹', '🎄', '🗿', '🍫', '🍦', '🍧', '🩺', 
            '🚇', '🎫', '📱', '🧾', '🐹',
        ],
        [ ##столбцы предметов в бд
            'walrus', 'lootbox', 'cow', 'key', 'fox', 'pistol', 'wolf', 'vest', 'angry_mask',
            'workers', 'bomb', 'confetti', 'fireworks', 'firework', 'babka', 'santa',
            'fairy', 'snow', 'snegovik', 'yozh', 'truck', 'gold_medal', 'silver_medal',
            'bronze_medal', 'poison', 'medicine', 'bread', 'milk', 'soup', 'pelmeni',
            'apple', 'shaurma', 'burger', 'pizza','cocoa', 'kiwi', 'tomato', 'fries',
            'cucumber', 'pasta', 'donut', 'sushi', 'beer', 'meat', 'cheburek','tea',
            'rice', 'cookie', 'cake', 'yogurt', 'meatcake', 'car', 'bluecar', 'clown',
            'ghost', 'alien','robot', 'shit', 'porridge', 'kisel', 'cactus', 'palm', 
            'houseplant', 'clover', 'tulip', 'rose', 'tree','moyai', 'chocolate', 
            'icecream', 'fruitice', 'medic', 'token', 'traintoken', 'phone',
            'trolleytoken', 'hamster',
        ],
        [ ##названия предметов
            'Морж', 'Лутбокс', 'Корова', 'Ключ', 'Лиса', 'Пистолет', 'Волк',
            'Бронежилет', 'Маска', 'Наёмники', 'Бомба', 'Конфетти', 'Фейерверки',
            'Хлопушка', 'Миссис Клаус', 'Санта Клаус', 'Фея', 'Снежинка', 'Снеговик',
            'Ёж', 'Грузовик', 'Золотая медаль', 'Серебряная медаль',
            'Бронзовая медаль', 'Яд', 'Лекарство', 
            'Хлеб', 'Молоко', 'Суп', 'Пельмени', 'Яблоко', 'Шаурма', 'Гамбургер',
            'Пицца', 'Кокос', 'Киви', 'Томат', 'Картошка фри', 'Огурец', 'Макароны',
            'Пончик', 'Суши', 'Пиво', 'Мясо', 'Чебурек', 'Чай', 'Рис', 'Печенье', 'Торт',
            'Йогурт', 'Лепёшка с мясом', 'Красный автомобиль', 'Синий автомобиль', 'Маска клоуна', 'Маска призрака',
            'Шлем пришельца', 'Робот', 'Какашка', 'Каша', 'Кисель', 'Кактус', 'Пальма',
            'Комнатное растение', 'Клевер', 'Тюльпан', 'Роза', 'Ёлка', 'Ждун',
            'Шоколад', 'Мороженое', 'Фруктовый лёд', 'Стетоскоп', 'Жетон метро',
            'Билет на поезд', 'Телефон', 'Проездной талон', 'Хомяк',
        ],
        [ ##стоимость предметов в магазинах
            250, 0, 150, 0, 500, 1000, 500, 1000, 750, 2500, 1000, 50, 75, 50, 75, 100,
            50, 30, 50, 100, 3000, 0, 0, 0, 4000, 500, 25, 25, 50, 50, 25, 10, 10, 10,
            500, 200, 25, 10, 25, 100, 50, 500, 10, 25, 10, 25, 200, 50, 75, 50, 30, 10000, 15000, 100,
            100, 100, 100, 100, 20, 20, 250, 250, 75, 100, 75, 100, 100, 100, 50, 75,
            50, 0, 20, 30, 800, 15, 150
        ], 
        [ ##категории предметов
            'mask', 'lootbox', 'mask', 'key', 'mask', 'rob', 'mask', 'rob', 'rob',
            'rob', 'rob', 'mask', 'mask', 'mask', 'mask', 'mask', 'mask', 'mask',
            'mask', 'mask', 'rob', 'mask', 'mask', 
            'mask', 'poison', 'medicine', 'food', 'food', 'food', 'food', 'food', 'food',
            'food', 'food', 'food', 'food', 'food', 'food', 'food', 'food', 'food',
            'food', 'food', 'food', 'food', 'food', 'food', 'food', 'food', 'food', 'food',
            'car', 'car', 'mask', 'mask', 'mask', 'mask', 'mask', 'food', 'food', 'mask', 'mask', 'mask',
            'mask', 'mask', 'mask', 'mask', 'mask', 'food', 'food', 'food', 'mask',
            'token', 'token', 'phone', 'token', 'mask'
        ],
        [ ##описания предметов
            'очень любят баны', 'в нём может быть что-то интересное',
            'даёт молоко, но только на ферме', 'пропуск на Чёрный рынок',
            'она украла текст. Теперь здесь нет ничего. Ну, кроме котиков, разумеется.\n&#128049;&#128049;&#128008;&#128008; Коты захватили мир!!!',
            'не бойтесь, он водный', 'слабее льва и тигра, но волк не выступает в цирке &#9757;', 
            'спасёт от пистолета. Или нет...', 'её нельзя надеть',
            'солнце ещё высоко!', 'бум', 'Новый год!', 'вау, красиво',
            'фейерверк на минималках', 'тоже дарит подарки', 'дарит подарки', 'украдёт твои зубы', 'первый снег!', 'много снега!', 'живой кактус',
            'большая машинка', 'крутой', 'почти победил', 'тоже неплохо',
            'а это уже не так весело', 'жить без яда правильно!', 'ou, vi iz Francia?', 'сейчас довольно трудно добыть', 'жиденькое',
            'много мяса, мало теста', 'и доктор не нужен', 'опасно есть',
            'вкусно и точка', 'чудо кулинарии', 'да, кокос', 'это не птица', 'полезно!', 'нет, она не бесплатная', 'тоже полезно!', 'оу, вы из Италии?',
            'а зачем дырка?', 'дорого...', 'алкоголь фу', 'можно, если ты собака',
            'не уверен, что это съедобно', 'индийский чай', 'что-то на японском', 'вы принимаете Cookies?',
            'на день рождения', 'нет, маленькая жирная жаба', 'зачем?', 'мажор',
            'мажор x1,5', 'сам такой', 'бууу', 'новый сюжет для Рен-ТВ', 
            'нет, это не разраб Живополиса', 'воняет',
            'кушай каждый день, чтобы стать крутым', 'вязкое...', 'колючее...',
            'вы почти на Живомальдивах', 'комнатное...', 'оо, повезло-повезло', 
            'роза Lite', 'красивое...', 'раз, два, три, ёлочка, гори!',
            'ждёт обновление Живополиса',
            'говорят, шоколад полезен для мозга. Если вы, конечно, не жаба (у жаб просто мозга нет)',
            'много вкуса, много веселья!', 'ты действительно собираешься это есть?',
            'теперь вы можете на законном основании писать непонятным почерком',
            'лучший вид транспорта', 'дороговато, зато быстрее, чем на метро',
            'выключи, не порти глаза!', 'для комфортной поездки на троллейбусе',
            'не забудь запереть клетку, а то сбежит'
        ],
        [ ##HTML-коды иконок предметов для базы данных
            '&#129453;', '&#128230;', '&#128004;', '&#128477;', '&#129418;',
            '&#128299;', '&#128058;', '&#129466;', '&#128122;', '&#128104;',
            '&#128163;', '&#127882;', '&#127878;', '&#127881;',  '&#129334;', '&#127877;', '&#129498;', '&#10052;', '&#9731;', '&#129428;',
            '&#128666;', '&#129351;', '&#129352;', '&#129353;', '&#129514;',
            '&#128138;', '&#129366;', '&#129371;', '&#127836;', '&#127858;', '&#127823;', '&#127791;',
            '&#127828;', '&#127829;', '&#129381;', '&#129373;', '&#127813;',
            '&#127839;', '&#129362;', '&#127837;', '&#127849;', '&#127857;', '&#127866;', '&#127830;', '&#129375;', '&#9749;', '&#127834;',
            '&#127850;', '&#127856;', '&#127862;', '&#129369;', '&#128663;',
            '&#128665;', '&#129313;', '&#128123;',  '&#128125;', '&#129302;', '&#128169;', '&#129749;', '&#129380;',
            '&#127797;', '&#127796;', '&#129716;', '&#127808;', '&#127799;',
            '&#127801;', '&#127876;', '&#128511;', '&#127851;', '&#127846;',
            '&#127847;', '&#129658;', '&#128647;', '&#127915;', '&#128241;',
            '&#129534;', '&#128057;'
        ],
    ]
'''
ITEMS = {
        ## name: [icon, database slot name, name, cost, category, description, html-code of item's icon]
        'walrus': ['🦭', 'walrus', 'Морж', 250, ['mask'], 'очень любят баны'],
        'lootbox': ['📦', 'lootbox', 'Лутбокс', -1, ['lootbox'], 'в нём может быть что-то интересное'],
        'cow': ['🐄', 'cow', 'Корова', 150, ['mask'], 'даёт молоко, но только на ферме'],
        'key': ['🗝', 'key', 'Ключ', -1, ['key'], 'пропуск на Чёрный рынок'],
        'fox': ['🦊', 'fox', 'Лиса', 500, ['mask'], 'она украла текст. Теперь здесь нет ничего. Ну, кроме котиков, разумеется.\n🐈🐈🐈🐈 Коты захватили мир!!!'],
        'gun': ['🔫', 'gun', 'Пистолет', 1000, ['robber'], 'не бойтесь, он водный'],
        'wolf': ['🐺', 'wolf', 'Волк', 500, ['mask'], 'слабее льва и тигра, но волк не выступает в цирке ☝'],
        'vest': ['🦺', 'vest', 'Бронежилет', 1000, ['robber'], 'спасёт от пистолета. Или нет...', ],
        'japanese_goblin': ['👺', 'japanese_goblin', 'Маска', 750, ['robber'], 'её нельзя надеть', ],
        'ninja': ['🥷🏽', 'ninja', 'Ниндзя', 2500, ['robber'], 'древний китайский ниндзя, которому уже много-много лет…\n\n**китайская партия одобряет'],
        'bomb': ['💣', 'bomb', 'Бомба', 1000, ['robber'], 'бум'],
        'confetti': ['🎊', 'confetti', 'Конфетти', 50, ['mask']],
        'fireworks': ['🎆', 'fireworks', 'Фейерверки', 75, ['mask']],
        'party_popper': ['🎉', 'party_popper', 'Хлопушка', 50, ['mask']],
        'mrs_claus': ['🤶', 'mrs_claus', 'Миссис Клаус', 75, ['mask']],
        'santa_claus': ['🎅', 'santa_claus', 'Санта Клaус', 100, ['mask']],
        'fairy': ['🧚', 'fairy', 'Фея', 50, ['mask']],
        'snowflake': ['❄️', 'snowflake', 'Снежинка', 30, ['mask']],
        'snowman': ['☃️', 'snowman', 'Снеговик', 50, ['mask']],
        'hedgehog': ['🦔', 'hedgehog', 'Еж', 100, ['mask']],
        'truck': ['🚚', 'truck', 'Грузовик', 3000, ['mask']],
        'gold_medal': ['🥇', 'gold_medal', 'Золотая медаль', -1, ['mask']],
        'silver_medal': ['🥈', 'silver_medal', 'Серебренная медаль', -1, ['mask']],
        'bronze_medal': ['🥉', 'bronze_medal', 'Бронзовая медаль', -1, ['mask']],
        'poison': ['🧪', 'poison', 'Яд', 4000, ['robber']],
        'pill': ['💊', 'pill', 'Таблетка', 500, ['medicine']],
        'baguette': ['🥖', 'baguette', 'Багет', 25, ['food']],
        'milk': ['🥛', 'milk', 'Молоко', 25, ['food']],
        'ramen': ['🍜', 'ramen', 'Рамен', 25, ['food']],
        'pelmeni': ['🍲', 'pelmeni', 'Пельмени', 50, ['food']],
        'apple': ['🍎', 'apple', 'Яблоко', 50, ['food']],
        'shawarma': ['🌯', 'shawarma', 'Шаурма', 25, ['food']],
        'burger': ['🍔', 'burger', 'Бургер', 500, ['food']],
        'pizza': ['🍕', 'pizza', 'Пицца', 200, ['food']],
        'coconut': ['🥥', 'coconut', 'Кокос', 25, ['food']],
        'kiwi': ['🥝', 'kiwi', 'Kиви', 10, ['food']],
        'tomato': ['🍅', 'tomato', 'Помидор', 10, ['food']], 
        'fries': ['🍟', 'fries', 'Картофель Фри', 10, ['food']],
        'cucumber': ['🥒', 'cucumber', 'Огурец', 10, ['food']],
        'spaghetti':['🍝', 'spaghetti', 'Спагетти', 10, ['food']],
        'doughnut': ['🍩', 'doughnut', 'Пончик', 10, ['food']],
        'bento': ['🍱', 'bento', 'Бенто', 500, ['food']],
        'beer': ['🍺', 'beer', 'Пиво', 200, ['food']],
        'meat_on_bone': ['🍖', 'meat_on_bone', 'Мясо на кости', 200, ['food']],
        'cheburek': ['🥟', 'cheburek', 'Чeбурек', 50, ['food']],
        'tea': ['🍵', 'tea', 'Чай', 50, ['food']],
        'coffee': ['☕', 'coffee', 'Кофе', 50, ['food']],
        'rice': ['🍚', 'rice', 'Рис', 70, ['food']],
        'cookie': ['🍪', 'cookie', 'Печенье', 20, ['food', 20], 'cookie'],
        'cake': ['🍰', 'cake', 'Торт', 500, ['food']],
        'sake': ['🍶', 'sake', 'Саке', 100, ['food']],
        'pita': ['🥙', 'pita', 'Пита Сэндвич', 200, ['food']],
        'red_car': ['🚗', 'red_car', 'Красная машина', 10000, ['car', 1]],
        'blue_car': ['🚙', 'blue_car', 'Синяя машина', 15000, ['car', 2]],
        'racing_car': ['🏎️', 'racing_car', 'Гоночный автомобиль', 40000, ['car', 5]],
        'clown': ['🤡', 'clown', 'Клоун', 100, ['mask']],
        'ghost': ['👻', 'ghost', 'Призрак', 100, ['mask']],
        'alien': ['👽', 'alien', 'Пришелец', 100, ['mask']],
        'robot': ['🤖', 'robot', 'Робот', 100, ['mask']],
        'shit': ['💩', 'shit', 'Какашка', 100, ['mask']],
        'fondue': ['🫕', 'fondue', 'Фондю', 100, ['food', 100]],
        'juice': ['🥤', 'juice', 'Сок', 100, ['food']],
        'cactus': ['🌵', 'cactus', 'Кактус', 250, ['mask']],
        'palm': ['🌴', 'palm', 'Пальма', 345, ['mask']],
        'potted_plant': ['🪴', 'potted_plant', 'Комнатное растение', 55, ['mask']],
        'clover': ['🍀', 'clover', 'Клевер', 55, ['mask']],
        'tulip': ['🌷', 'tulip', 'Тюльпан', 99, ['mask']],
        'rose': ['🌹', 'rose', 'Роза', 123, ['mask']],
        'xmas_tree': ['🎄', 'xmas_tree', 'Новогодняя елка', 123, ['mask']],
        'moyai': ['🗿', 'moyai', 'Моаи', 123, ['mask']],
        'chocolate': ['🍫', 'chocolate', 'Плитка шоколада', 321, ['food']],
        'shaved_ice': ['🍧', 'shaved_ice', 'Фруктовый лед', 41, ['food']],
        'ice_cream': ['🍨', 'ice_cream', 'Мороженое', 569, ['food']],
        'stethoscope': ['🩺', 'stethoscope', 'Стетоскоп', 444, ['mask']],
        'metro': ['🚇', 'metro', 'Metro', 10, ['token']],
        'traintoken': ['🎫', 'traintoken', 'Train', 10, ['token']],
        'phone': ['📱', 'phone', 'Phone', 1000000, ['phone']],
        'troleytoken': ['🧾', 'trolleytoken', 'Trolley', 10, ['token']],
        'hamster': ['🐹', 'hamster', 'Hamster', 100, ['mask']],
    }

market = []

clanitems = \
    [
        [ ##предметы, доступные для покупки в кланах
            'medicine', 'kisel', 'porridge'
        ], 
        [ ##стоимость предметов в кланах
            400, 20, 20
        ]
    ]

traincost = 30  #стоимость билета на поезд
metrocost = 20  #стоимость жетона метро
trolleycost = 15  #стоимость проездного талона
aircost = 75  #стоимость полёта на самолёте
buscost = 100  #стоимость поездки на маршрутке
regbuscost = 50  #стоимость поездки на междугородном автобусе
fightlim = 60  #кулдаун при битвах
ticket_time = 720  #время, через которое сообщение

#интервалы и продолжительность посадки на разные ТС (в секундах)
intervals = \
    {
        'metro': [300, 60], #интервал движения поездов метро
        'trolleybus': [600, 120], #интервал движения городских троллейбусов
        'train': [1200, 240], #интервал движения поездов региональных линий
        'bus': [1200, 300], #интервал движения междугородных автобусов
        'plane': [3600, 1800],  #интервал движения самолётов
        'taxi': [900, 90], #интервал движения пригородных маршрутных такси
        'citylines': [600, 60],  #интервал движения поездов городских линий
    }  

#сообщения, появляющиеся по команде /start
randomtext = [
    'Мы все равны: и разумные существа, и жабы', 'Время валить отсюда',
    'Опять цены на проезд повысили :(', 'лёгушька', 'Слава Василию!',
    'В главных ролях', 'Слава Миките', 'Где можно купить немного денег?',
    'А сейчас мы с вами наблюдаем жабу - самое беспомощное и бессмысленное существо во Вселенной',
    'Типичное состояние жителя Живополиса - <b>$0</b>',
    'У нас закончилось всё... И деньги в том числе',
    'Чтобы прокатиться на метро, нажмите "Город"',
    'Ехал жаба через жаба\nВидит жаба - в жабе жаба\nСунул жаба лапу в жаба\nЖабу жаба <b>____</b>\n<b>Вывод:</b> не будьте жабой',
    '<code>слава миките слава миките слава миките</code>\nЧто делать с этим текстом, решайте сами',
    'Обычно этот текст не читают',
    'Квадрат гипотенузы равен сумме квадратов катетов',
    'Пока еноты у власти Живополиса наедаются макаронами, простые смертные вынуждены есть хлеб, которого в магазинах уже нет(',
    'I like to move it, move it',
    'Сколько раз за этот месяц повышали цены на еду? Так жить нельзя',
    'И запомните, дети: Микита - самый некоррумпированный император за всю историю человечества',
    'Еноты - и точка', 'No zhabas', 'почему', 'Наконец-то с инлайн-режимом', 
    'вентигурелятор 3000 - новый вентилятор регулирующий ваш баланс. С таким больше 3000 вы никогда не наберёте! ещё и вентилятор в подарок',
    '👁👄👁', 'ходят слухи, что админы живополиса гнобят жаб…',
]

#айди канала состояния бота
botstate = -1001564276460

#приветствия по команде /start
hellos = [
    'Привет', 'Здравия желаю', 'Добро пожаловать',
    'Добро пожаловать в Живополис', 'Здравствуйте', 'Приветствую',
    'Приветствуем', 'С днём енота', 'Как дела', 'Как поживаешь'
]

#еда
FOOD = [
    [
        'bread', 'milk', 'soup', 'pelmeni', 'apple', 'shaurma', 'burger', 'pizza',
        'cocoa', 'kiwi', 'tomato', 'fries', 'cucumber', 'pasta', 'donut', 'sushi',
        'beer', 'meat', 'cheburek', 'tea', 'rice', 'cookie', 'cake', 'yogurt',
        'meatcake', 'porridge', 'kisel', 'chocolate', 'icecream', 'fruitice'
    ], 
    [
        3, 15, 10, 7, 5, 1000, 1000, 900, 20, 10, 5, 900, 5, 5, 5, 20, 5, 5, 900,
        5, 10, 5, 10, 5, 7, 5, 5, 7, 10, 7
    ], []]

#насыщение от разных видов еды

#опыт для уровней
levelrange = [
    0, 1, 5, 10, 20, 30, 45, 70, 100, 140, 200, 250, 310, 380, 450, 520, 610,
    700, 800, 910, 1030, 1050, 1100, 1200, 1320, 1500, 1750, 2000, 2100, 2250,
    2500, 2750, 3000, 3500, 4000, 4500, 5000, 5750, 6500, 7500, 8500, 10000,
    12500
]
#описания уровней
leveldesc = [
    '', '', '', '', '<b>Доступные функции:</b>\n&#128661; Поездка на такси',
    '<b>Доступные функции:</b>\n&#128275; Создание публичного клана', '', '',
    '<b>Доступные предметы:</b>\n&#128663; Красный автомобиль\n&#128665; Синий автомобиль',
    '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''
]

lvlcar = 8  #минимальный уровень для покупки машины
lvlclan = 5  #минимальный уровень для создания публичного клана
lvlcab = 4  #минимальный уровень для поездки на такси
cabcost = 5  #минимальная стоимость поездки на такси

#линии метро в именительном падеже
LINES = [
    'Восточная линия городской электрички', 'Первоапрельская линия',
    'Кольцевая линия городской электрички', 'Электрозаводская линия'
]
#линии метро в родительном падеже
linez = [
    'Восточной линии городской электрички', 'Первоапрельской линии',
    'Кольцевой линии городской электрички', 'Электрозаводской линии'
]
#страны и столицы для Географии в университете
countries = [
    '🇰🇵 КНДР', '🇫🇮 Финляндия', '🇩🇰 Дания', '🇳🇴 Норвегия', '🇸🇪 Швеция',
    '🇨🇭 Швейцария', '🇮🇸 Исландия', '🇹🇷 Турция', '🇧🇾 Республика Беларусь',
    '🇨🇳 Китайская Народная Республика', '🇰🇷 Республика Корея', '🇰🇿 Казахстан',
    '🇮🇱 Израиль', '🇨🇾 Кипр', '🇧🇷 Бразилия', '🇷🇺 Российская Федерация',
    '🇺🇦 Украина', '🇩🇪 ФРГ', '🇫🇷 Франция', '🇯🇵 Япония', '🇦🇩 Андорра',
    '🇱🇰 Шри-Ланка', '🇷🇸 Сербия', '🇱🇮 Лихтенштейн', '🇹🇩 Чад', '🇺🇿 Узбекистан',
    '🇦🇷 Аргентина', '🇪🇨 Эквадор', '🇮🇹 Италия', '🇪🇸 Испания', '🇵🇹 Португалия',
    '🇮🇪 Ирландия', '🇬🇧 Соединённое Королевство', '🇹🇲 Туркмения', '🇺🇬 Уганда',
    '🇧🇬 Болгария', '🇭🇷 Хорватия', '🇲🇪 Черногория', '🇮🇷 Иран', '🇹🇿 Танзания',
    '🇨🇲 Камерун', '🇧🇫 Буркина-Фасо', '🇲🇳 Монголия', '🇸🇱 Сьерра-Леоне',
    '🇬🇳 Гвинея', '🇬🇼 Гвинея-Бисау', '🇪🇬 Египет', '🇿🇦 ЮАР', '🇳🇿 Новая Зеландия',
    '🇦🇺 Австралия', '🇬🇷 Греция', '🇧🇳 Бруней', '🇲🇾 Малайзия', '🇱🇸 Лесото',
    '🇰🇬 Кыргызстан'
]
capitals = [
    'Пхеньян', 'Хельсинки', 'Копенгаген', 'Осло', 'Стокгольм', 'Берн',
    'Рейкьявик', 'Анкара', 'Минск', 'Пекин', 'Сеул', 'Нур-Султан', 'Иерусалим',
    'Никосия', 'Бразилиа', 'Москва', 'Киев', 'Берлин', 'Париж', 'Токио',
    'Андорра-ла-Велья', 'Шри-Джаяварденепура-Котте', 'Белград', 'Вадуц',
    'Нджамена', 'Ташкент', 'Буэнос-Айрес', 'Кито', 'Рим', 'Мадрид', 'Лиссабон',
    'Дублин', 'Лондон', 'Ашхабад', 'Кампала', 'София', 'Загреб', 'Подгорица',
    'Тегеран', 'Додома', 'Яунде', 'Уагадугу', 'Улан-Батор', 'Фритаун',
    'Конакри', 'Бисау', 'Каир', 'Претория', 'Веллингтон', 'Канберра', 'Афины',
    'Бандар-Сери-Бегаван', 'Куала-Лумпур', 'Масеру', 'Бишкек'
]
ach = [[], [], [], [], [], [], [], []]

ACHIEVEMENTS = \
    {   #achievement: name, description, [reward: money, XP], db slot
        'first_jackpot': [''],
        'masquerade': ['&#128122; Маскарад', 'Наденьте любую маску', [10, 4], 'masquerade'],
    }
#достижения
ach[0] = [
    'jkp', 'lucky', 'firstwin', 'myauto', 'helper', 'black', 'medquest',
    'busride', 'flightach', 'walkach', 'soldach', 'cabach'
]
#названия достижений
ach[1] = [
    '&#127808; Удача в придачу', '&#127920; Профессиональный игрок',
    '&#9876; Первая победа', '&#128663; Личное авто', '&#128138; Спасатель',
    '&#129689; На другой стороне', '&#129658; Клятва Гиппократа',
    '&#128652; Вдалеке от цивилизации', '&#128745; Полёт нормальный',
    '&#128694; Лучший вид транспорта', '&#128178; Барыга', '&#128661; Дорого-богато'
]
#описания достижений
ach[2] = [
    'Поймайте джекпот, играя в Игровом клубе', '10 раз поймайте джекпот, играя в Игровом клубе',
    'Победите кого-нибудь в поединке. Чтобы начать бой, напишите <code>бой</code> в ответ на любое сообщение соперника',
    'Купите любой автомобиль в Автопарке', 'Воскресите умершего игрока',
    'Зайдите на Чёрный рынок',
    'Вылечите 20 игроков от травмы или смерти, используя Лекарства',
    'Свалите на маршрутке в любую деревню через Автовокзал',
    'Полетайте на самолёте', '20 раз походите пешком',
    '10 раз продайте любой товар на Центральном рынке', 'Проедьте на такси от самой первой в списке до самой последней местности'
]
#награда за достижения (деньги)
ach[3] = [10, 50, 200, 10, 100, 50, 100, 150, 150, 100, 100, 150, 150]
#награда за достижения (опыт)
ach[4] = [4, 10, 25, 5, 10, 10, 15, 20, 20, 15, 10, 20, 15]
#столбцы, показывающие степень выполнения достижений
ach[5] = [
    'jkp', 'jackpots', 'firstwin', 'myauto', 'helper', 'black', 'cured',
    'busride', 'flightach', 'walk', 'sold', 'cabach'
]
#максимальная степень выполнения достижений
ach[6] = [1, 1, 10, 1, 1, 1, 1, 20, 1, 1, 20, 10, 1]
#категории достижений
ach[7] = ['Игровой процесс', 'Нелегальные занятия', 'Нелегальные занятия', 'Игровой процесс', 'Игровой процесс',  'Помощь игрокам',  'Нелегальные занятия', 'Помощь игрокам', 'Путешествия', 'Путешествия', 'Путешествия', 'Игровой процесс', 'Путешествия']
locations = [
    [
        '🏬 ТЦ МиГ', '🍰 СладкоЁжка', '🍏 Натурал', '🏣 Рынок', '🦊 Зоопарк',
        '🌲 Ботанический сад', '📱 Магазин техники', '🚗 Автопарк', '🏭 Электрозавод',
        '🏫 Университет', '🌾 Ферма', '🏥 Райбольница', '🏥 Старокотайский ФАП',
        '✈ Нац. аэропорт', '✈ Аэропорт Котай', '🚆 Центральный вокзал',
        '🚆 Александровский вокзал', '🚆 Котайский вокзал', '🚌 АВ Живополис',
        '🚌 АС Александрово', '🏦 Живбанк', '🏟 Живополис-Арена'
    ],
    [
        'Крупный торговый центр. Магазины:\n👚 ModaShop\n🍚 Ресторан японской кухни "Япон Енот"\n🍔 Енот Кебаб',
        'Кондитерская с очень вкусной едой', 'Магазин с фруктами и овощами',
        'Вам нужно сюда, если у вас есть ненужная еда или маски, которые вы хотите продать',
        'Магазин масок в виде животных', 'Магазин "цветочных" масок',
        'Магазин электронных устройств', 'Лучшие автомобили Живополиса!',
        'Место для заработка денег с помощью мини-игр',
        'Здесь можно получить опыт, играя в мини-игры',
        'Здесь можно подоить корову и получить молоко',
        'Здесь можно купить таблетки',
        'Быстрый доступ к таблеткам для деревенских жителей',
        'Аэровокзал города Живополис', 'Аэровокзал города Котай',
        'Железнодорожный вокзал города Живополис',
        'Железнодорожный вокзал городка Александрово',
        'Железнодорожный вокзал города Котай', 'Автовокзал города Живополис',
        'Небольшой автовокзальчик городка Александрово',
        'Крупнейший банк Живополиса, который можно ограбить :)',
        'Основной турнирный стадион Живополиса'
        ], [], []]
#названия локаций

#описания локаций

#местности локаций
locations[2] = [
    'ТЦ МиГ', 'Георгиевская', 'Макеевка', 'Рынок', 'Зоопарк', 'Ботаническая',
    'Генерала Шелби', 'Автопарк им. Кота', 'Котайский электрозавод',
    'Университет', 'Роща', 'Райбольница', 'Старокотайский ФАП',
    'Национальный аэропорт', 'Аэропорт Котай', 'Вокзальная', 'Александровская',
    'Станция Котай', 'Автовокзал Живополис', 'АС Александрово', 'Живбанк',
    'Стадион'
]
#категории локаций
locations[3] = [
    'Торговля', 'Торговля', 'Торговля', 'Торговля', 'Торговля', 'Торговля',
    'Торговля', 'Торговля', 'Заработок', 'Заработок', 'Заработок', 'Здоровье',
    'Здоровье', 'Транспорт', 'Транспорт', 'Транспорт', 'Транспорт',
    'Транспорт', 'Транспорт', 'Транспорт', 'Прочее', 'Прочее'
]

trains = \
    [
        [ ##местности с о.п. поезда
            'Вокзальная', 'Александровская', 'Национальный аэропорт', 'Макеевка',
            'Роща', 'Станция Котай',
        ], 
        [ ##короткие названия о.п.
            'Живополис', 'Александрово', 'Национальный аэропорт',
            'Макеевка', 'Роща', 'Котай',
        ], 
        [ ##полные названия о.п.
            'Живополис-Пассажирский', 'Александрово',
            'Национальный аэропорт Живополис', 'Деревня Макеевка', 'Роща',
            'Котай-Пассажирский'
        ],
    ]